garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1716.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC1SEL2" edc:desc="Input select register 2" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC1SEL2" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF14">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D3S0" edc:desc="" edc:mask="0x1" edc:name="LC1D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S1" edc:desc="" edc:mask="0x1" edc:name="LC1D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S2" edc:desc="" edc:mask="0x1" edc:name="LC1D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S3" edc:desc="" edc:mask="0x1" edc:name="LC1D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D3S4" edc:desc="" edc:mask="0x1" edc:name="LC1D3S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D3S" edc:desc="" edc:mask="0x1f" edc:name="LC1D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D3S" edc:desc="" edc:mask="0x1f" edc:name="D3S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D3S0" edc:desc="" edc:mask="0x1" edc:name="D3S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S1" edc:desc="" edc:mask="0x1" edc:name="D3S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S2" edc:desc="" edc:mask="0x1" edc:name="D3S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S3" edc:desc="" edc:mask="0x1" edc:name="D3S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3S4" edc:desc="" edc:mask="0x1" edc:name="D3S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLC1SEL3" edc:desc="Input select register 3" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLC1SEL3" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF15">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1D4S0" edc:desc="" edc:mask="0x1" edc:name="LC1D4S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S1" edc:desc="" edc:mask="0x1" edc:name="LC1D4S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S2" edc:desc="" edc:mask="0x1" edc:name="LC1D4S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S3" edc:desc="" edc:mask="0x1" edc:name="LC1D4S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1D4S4" edc:desc="" edc:mask="0x1" edc:name="LC1D4S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1D4S" edc:desc="" edc:mask="0x1f" edc:name="LC1D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D4S" edc:desc="" edc:mask="0x1f" edc:name="D4S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D4S0" edc:desc="" edc:mask="0x1" edc:name="D4S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S1" edc:desc="" edc:mask="0x1" edc:name="D4S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S2" edc:desc="" edc:mask="0x1" edc:name="D4S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S3" edc:desc="" edc:mask="0x1" edc:name="D4S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4S4" edc:desc="" edc:mask="0x1" edc:name="D4S4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC1GLS0" edc:desc="Gate logic select register 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC1GLS0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF16">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G1D1N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D1T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D2N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D2T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D3N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D3T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D4N" edc:desc="" edc:mask="0x1" edc:name="LC1G1D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G1D4T" edc:desc="" edc:mask="0x1" edc:name="LC1G1D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC1GLS1" edc:desc="Gate logic select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC1GLS1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF17">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1G2D1N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D1T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D2N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D2T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D3N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D3T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D4N" edc:desc="" edc:mask="0x1" edc:name="LC1G2D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1G2D4T" edc:desc="" edc:mask="0x1" edc:name="LC1G2D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1N" edc:desc="" edc:mask="0x1" edc:name="D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1T" edc:desc="" edc:mask="0x1" edc:name="D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2N" edc:desc="" edc:mask="0x1" edc:name="D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2T" edc:desc="" edc:mask="0x1" edc:name="D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3N" edc:desc="" edc:mask="0x1" edc:name="D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D3T" edc:desc="" edc:mask="0x1" edc:name="D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4N" edc:desc="" edc:mask="0x1" edc:name="D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D4T" edc:desc="" edc:mask="0x1" edc:name="D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
